8evgeny/GIT/7_Camera/MDR1986BExx/2.0.3/Examples/MDR1986VE3/MIL_STD_1553/Terminal Device/src/MIL_STD1553_IT_Handler.c
/**
  ******************************************************************************
  * @file    MIL_STD_1553_IT_Handler.c
  * @author  Milandr Application Team
  * @version V2.0.2
  * @date    21/09/2021
  * @brief   This file contains user interrupt handler for the MIL_STD_15531.
  ******************************************************************************
  * <br><br>
  *
  * THE PRESENT FIRMWARE WHICH IS FOR GUIDANCE ONLY AIMS AT PROVIDING CUSTOMERS
  * WITH CODING INFORMATION REGARDING THEIR PRODUCTS IN ORDER FOR THEM TO SAVE
  * TIME. AS A RESULT, MILANDR SHALL NOT BE HELD LIABLE FOR ANY DIRECT, INDIRECT
  * OR CONSEQUENTIAL DAMAGES WITH RESPECT TO ANY CLAIMS ARISING
  * FROM THE CONTENT OF SUCH FIRMWARE AND/OR THE USE MADE BY CUSTOMERS OF THE
  * CODING INFORMATION CONTAINED HEREIN IN CONNECTION WITH THEIR PRODUCTS.
  *
  * <h2><center>&copy; COPYRIGHT 2021 Milandr </center></h2>
  ******************************************************************************
  */

/* Includes ------------------------------------------------------------------*/
#include "MDR32F9Qx_config.h"
#include "MIL_STD_1553_IT_Handler.h"
#include "MDR1986VE3_IT.h"
#include "MDR1986VE3.h"
#include "MDR32F9Qx_mil_std_1553.h"
#include "MDR32F9Qx_port.h"
#include "MDR32F9Qx_timer.h"

/** @addtogroup __MDR32Fx_StdPeriph_Examples MDR32Fx StdPeriph Examples
  * @{
  */

/** @addtogroup __MDR1986VE3_EVAL MDR1986VE3 Evaluation Board
  * @{
  */

/** @addtogroup MIL_STD_1553_Terminal_Device_VE3 MIL_STD_1553 Terminal Device
 *  @{
 */

/* Private typedef -----------------------------------------------------------*/
typedef enum {
    RX_BC_TD                           = 0x0001,
    RX_BC_TD_GROUP                     = 0x0080,
    RX_TD_TD                           = 0x0004,
    RX_TD_TD_GROUP                     = 0x0100,
    TX_TD_BC                           = 0x0402,
    TX_TD_TD                           = 0x1008,
    TX_TD_TD_GROUP                     = 0x0200,
    CONTROL_COMMAND_NO_DATA            = 0x0410,
    CONTROL_COMMAND_NO_DATA_GROUP      = 0x0400,
    CONTROL_CPMMAND_WITH_DATA          = 0x2420,
    CONTROL_CPMMAND_WITH_DATA_TX       = 0x0040,
    CONTROL_CPMMAND_WITH_DATA_GROUP_TX = 0x0800
}MSG_TypeDef;

/* Variables ---------------------------------------------------------*/
uint32_t CommandWordFlag = 0;
uint32_t GruopCommandFlag = 0;
uint32_t SaveModeDataFlag = 0;
uint32_t SetTDInDefaultFlag = 0;
uint32_t ReceivedNewControlWordflag = 0;
uint32_t CircularReturnDataFlag = 0;

uint32_t MIL_STD_1553_Data[32];
uint32_t MIL_STD_1553_Modedata;
uint32_t MIL_STD_1553_MSG;
uint32_t MIL_STD_1553_LastCommandWord = 0;

/* Private function prototypes -----------------------------------------------*/
FlagStatus ISControlCommand(MIL_STD_1553_CommandWordTypeDef * CommandWord);

/**
  * @brief  MIL_STD_1553 interrupt handler
  * @param  MIL_STD_1553x: Select the MIL_STD_1553 peripheral.
  *         This parameter can be one of the following values:
  *             MIL_STD_15531, MIL_STD_15532.
  * @retval None
  */
void My_MIL_STD_1553_Handler(MDR_MIL_STD_1553_TypeDef * MIL_STD_1553x)
{
    uint32_t MIL_STD_1553_Status;
    uint32_t MIL_STD_1553_Errors;
    MIL_STD_1553_CommandWordTypeDef MIL_STD_1553_CommandWord1 = {0};
    MIL_STD_1553_StatusWordTypeDef MIL_STD_1553StatusWord1 = {0};

    /* Get the Status register */
    MIL_STD_1553_Status = MIL_STD_1553_GetStatus(MIL_STD_1553x);
    /* Get the Errors register */
    MIL_STD_1553_Errors = MIL_STD_1553_GetErrorStatus(MIL_STD_1553x);

    /* Check for errors in the message */
    if ((MIL_STD_1553_Status & MIL_STD_1553_STATUS_ERR) != 0)
    {

        /* Enable interrupt at the transition to idle mode */
        MIL_STD_1553_ITConfig( MIL_STD_1553x,
                              (MIL_STD_1553_IT_RFLAGNIE | MIL_STD_1553_IT_VALMESSIE | MIL_STD_1553_IT_ERRIE),
                               DISABLE);
        MIL_STD_1553_ITConfig(MIL_STD_1553x, (MIL_STD_1553_IT_IDLEIE), ENABLE);

        /* Allow reset error */
        MIL_STD_1553_RERRCmd(MIL_STD_1553x, DISABLE);

        switch (MIL_STD_1553_Errors)
        {
            case MIL_STD_1553_ERROR_NORCV:
                /* Reception error */
                PORT_SetBits(MDR_PORTB, PORT_Pin_0);
                break;
            case MIL_STD_1553_ERROR_MANERR:
                /* NRZ decoding error code */
                PORT_SetBits(MDR_PORTB, PORT_Pin_1);
                break;
            case MIL_STD_1553_ERROR_SYNCERR:
                /* Synchronization data error */
                PORT_SetBits(MDR_PORTB, PORT_Pin_2);
                break;
            case MIL_STD_1553_ERROR_SEQERR:
                /* Synchronization command error */
                PORT_SetBits(MDR_PORTB, PORT_Pin_3);
                break;
            case MIL_STD_1553_ERROR_GAPERR:
                /* Error invalid activity on the bus */
                PORT_SetBits(MDR_PORTB, PORT_Pin_4);
                break;
            case MIL_STD_1553_ERROR_CONERR:
                /* Error message of continuity */
                PORT_SetBits(MDR_PORTB, PORT_Pin_5);
                break;
            case MIL_STD_1553_ERROR_PROERR:
                /* Protocol error */
                PORT_SetBits(MDR_PORTB, PORT_Pin_6);
                break;
            default:
                /* Other errors */
                PORT_SetBits(MDR_PORTB, PORT_Pin_7);
                break;
        }
        /* Check flag CommandWordFlag */
        if(CommandWordFlag)
        {
            MIL_STD_1553StatusWord1.StatusWord = 0;
            MIL_STD_1553StatusWord1.Fields.TerminalDeviceAddress = MIL_STD_1553_TERMINAL_ADDRESS;
            MIL_STD_1553StatusWord1.Fields.ErrorBit = 1;

            /* Check flag GruopCommandFlag */
            if(GruopCommandFlag)
            {
                MIL_STD_1553StatusWord1.Fields.GroupCommandBit = 1;
                GruopCommandFlag = 0;
            }
            /* Set status word */
            MIL_STD_1553_SetStatusWord( MIL_STD_1553x,
                                        MIL_STD_1553_STATUS_WORD1,
                                        &MIL_STD_1553StatusWord1);
            /* Reset flag */
            CommandWordFlag = 0;
        }
    }
    else
    {
        /* Set RERR bit in the CCONTROL register */
        MIL_STD_1553_RERRCmd(MIL_STD_1553x, ENABLE);
        /*--------------------------------------------------------------------*/
        /* Check that the controller is switched to the idle mode */
        if ((MIL_STD_1553_Status & MIL_STD_1553_STATUS_IDLE) != 0)
        {

